<script lang="ts" setup>
useHead({
  title: "利用規約 | PSO2 Search Unofficial Item Search Engine",
  meta: [
    { property: "og:title", content: "利用規約 | PSO2 Search Unofficial Item Search Engine" },
    { property: "og:description", content: "PSO2 Searchにアイテム登録を行うためにアカウントを作成する際の利用規約です。" },
  ],
});
</script>

<template>
  <v-container class="d-flex align-center justify-center">
    <v-card variant="tonal" max-width="960">
      <v-card-title class="my-4 text-h4 font-weight-bold"
        >利用規約</v-card-title
      >
      <v-card-text class="text-caption text-md-body-1">
        <v-row class="ma-8">
          <v-col>
            この利用規約（以下、「本規約」）は、PSO2サーチ（以下、「本サービス」）の利用条件を定めるものです。
            登録ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。
            なお、本サービスの利用登録をされた場合、本規約に同意したものとみなします。<br />
            <div class="mt-4">
              なお、本サービスの利用登録をされた場合、本規約に同意したものとみなします。
            </div>
          </v-col>
        </v-row>
        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">第１条 本サービスの目的</div>
            本サービスの目的は以下のとおりです。
            <ol>
              <li>
                株式会社SEGAが提供するオンラインRPG「ファンタシースターオンライン２」（以下、「PSO2」）および「ファンタシースターオンライン２ニュージェネシス」（以下、「PSO2NGS」）のゲーム内におけるアイテム検索機能を補完すること。
              </li>
              <li>
                ゲームにログインして居なくとも、アイテムの情報に瞬時にアクセスできる利便性をプレイヤーに提供すること。
              </li>
              <li>
                その他PSO2およびPSO2NGSのプレイヤーにとって有益な情報を提供すること。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第２条 本サービスの位置づけ
            </div>
            本サービスは非公式のサードパーティ製ツールであり、株式会社SEGA及びPSO2またはPSO2NGSの運営スタッフ各位とは無関係です。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第３条 ユーザーの役割
            </div>
            本サービスにおいて、ユーザーは以下の役割を担います。
            <ol>
              <li>
                善意に基づき、無理のない範囲でPSO2またはPSO2NGSのアイテム情報を登録及び編集すること。
              </li>
              <li>
                登録済みの情報を可能な限り最新の状態に保つこと。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第４条 著作権および各種権利
            </div>
            本サービス上のアイテム情報やアイテムの画像は、株式会社SEGAの『ファンタシースターオンライン2』著作物利用ガイドライン』に則り、株式会社SEGAに属するものとします。<br />
            アイテム情報として登録する各種画像には、自動的に「&copy;SEGA」が挿入されます。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第５条（ユーザーIDおよびパスワードの管理）
            </div>
            <ol>
              <li>
                ユーザーは、自己の責任において、本サービスのユーザーIDおよびパスワードを適切に管理するものとします。
              </li>
              <li>
                ユーザーは、いかなる場合にも、ユーザーIDおよびパスワードを第三者に譲渡または貸与し、もしくは第三者と共用することはできません。当方は、ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には、そのユーザーIDを登録しているユーザー自身による利用とみなします。
              </li>
              <li>
                アカウント名に本名などの個人情報を用いることはお辞めください。当方は、アカウント名に本名などの個人情報を用いたことにより生じた損害について、一切の責任を負いません。
              </li>
              <li>
                ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害は、当方に故意又は重大な過失がある場合を除き、当方は一切の責任を負わないものとします。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">
              第６条（利用料金および支払方法）
            </div>
            本サービスの利用に際し、当方は一切の料金を請求いたしません。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">第７条（禁止事項）</div>
            ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
            <ol>
              <li>法令または公序良俗に違反する行為</li>
              <li>犯罪行為に関連する行為</li>
              <li>
                本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為
              </li>
              <li>
                当方、ほかのユーザー、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
              </li>
              <li>本サービスによって得られた情報を商業的に利用する行為</li>
              <li>本サービスの運営を妨害するおそれのある行為</li>
              <li>不正アクセスをし、またはこれを試みる行為</li>
              <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
              <li>不正な目的を持って本サービスを利用する行為</li>
              <li>
                本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為
              </li>
              <li>他のユーザーに成りすます行為</li>
              <li>
                当方が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為
              </li>
              <li>面識のない異性との出会いを目的とした行為</li>
              <li>
                本サービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為
              </li>
              <li>その他、当方が不適切と判断する行為</li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">
              第８条（本サービスの提供の停止等）
            </div>
            ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
            <ol>
              <li>
                当方は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
              </li>
              <ol>
                <li>
                  本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
                </li>
                <li>
                  地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合
                </li>
                <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                <li>その他、当方が本サービスの提供が困難と判断した場合</li>
              </ol>
              <li>
                当方は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第９条（利用制限および登録抹消）
            </div>
            <ol>
              <li>
                当方は、ユーザーが以下のいずれかに該当する場合には、事前の通知なく、ユーザーに対して、本サービスの全部もしくは一部の利用を制限し、またはユーザーとしての登録を抹消することができるものとします。
              </li>
              <ol>
                <li>本規約のいずれかの条項に違反した場合</li>
                <li>登録事項に虚偽の事実があることが判明した場合</li>
                <li>料金等の支払債務の不履行があった場合</li>
                <li>当方からの連絡に対し、一定期間返答がない場合</li>
                <li>
                  本サービスについて、最終の利用から一定期間利用がない場合
                </li>
                <li>
                  その他、当方が本サービスの利用を適当でないと判断した場合
                </li>
              </ol>
              <li>
                当方は、本条に基づき当方が行った行為によりユーザーに生じた損害について、一切の責任を負いません。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">第１０条（退会）</div>
            ユーザーは、当方の定める退会手続により、本サービスから退会できるものとします。<br>
            ただし、退会した場合においても、登録したアイテム情報は削除されません。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第１１条（保証の否認および免責事項）
            </div>
            <ol>
              <li>
                当方は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
              </li>
              <li>
                当方は、本サービスに起因してユーザーに生じたあらゆる損害について、当方の故意又は重過失による場合を除き、一切の責任を負いません。ただし、本サービスに関する当方とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。
              </li>
              <li>
                前項ただし書に定める場合であっても、当方は、当方の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当方またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。また、当方の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は、ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。
              </li>
              <li>
                当方は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">
              第１２条（サービス内容の変更等）
            </div>
            当方は、ユーザーへの事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第１３条（利用規約の変更）
            </div>
            <ol>
              <li>
                当方は以下の場合には、ユーザーの個別の同意を要せず、本規約を変更することができるものとします。
              </li>
              <ol>
                <li>本規約の変更がユーザーの一般の利益に適合するとき。</li>
                <li>
                  本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。
                </li>
              </ol>
              <li>
                当方はユーザーに対し、前項による本規約の変更にあたり、事前に、本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。
              </li>
            </ol>
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">
              第１４条（個人情報の取扱い）
            </div>
            当方は、本サービスの利用によって個人情報を取得しません。<br />
            当方「<NuxtLink to="/privacy">プライバシーポリシー</NuxtLink
            >」に従い、利用登録後のアカウントを管理するために必要な識別情報のみを取得します。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">
              第１５条（通知または連絡）
            </div>
            ユーザーと当方との間の通知または連絡は、当方の定める方法によって行うものとします。当方は,ユーザーから,当方が別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold mb-8">
              第１６条（権利義務の譲渡の禁止）
            </div>
            ユーザーは、当方の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。
          </v-col>
        </v-row>

        <v-row class="ma-8">
          <v-col>
            <div class="text-h5 font-weight-bold">
              第１７条（準拠法・裁判管轄）
            </div>
            <ol>
              <li>本規約の解釈にあたっては、日本法を準拠法とします。</li>
              <li>
                本サービスに関して紛争が生じた場合には、当方の本店所在地を管轄する裁判所を専属的合意管轄とします。
              </li>
            </ol>
          </v-col>
        </v-row>
        <div class="ma-12 text-h6 text-right">以上</div>
      </v-card-text>
    </v-card>
  </v-container>
</template>

<style scoped>
ol {
  padding-top: 20px;
  padding-bottom: 20px;
  padding-left: 40px;
}

li {
  padding-top: 10px;
  padding-bottom: 10px;
}
</style>
